InformationRegisters/b24_СтатистикаВыполненияЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>b24_СтатистикаВыполненияЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.b24_СайтИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/b24_СтатистикаВыполненияЗапросов/Ext/ManagerModule.bsl
Функция Записать(Дата, Сайт, Метод) Экспорт 
	
	НаборЗаписей 			= РегистрыСведений.b24_СтатистикаВыполненияЗапросов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Сайт.Установить(Сайт);
	НаборЗаписей.Отбор.Дата.Установить(Дата);
	НаборЗаписей.Отбор.Метод.Установить(Метод);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		
		Запись				= НаборЗаписей.Добавить();
		Запись.Дата 		= Дата;
		Запись.Сайт 		= Сайт;
		Запись.Метод 		= Метод;  
		Запись.Количество 	= 1;
		
	Иначе
		
		Запись				= НаборЗаписей[0];		
		Запись.Количество 	= Запись.Количество + 1;  
		
	КонецЕсли;
	
	НаборЗаписей.Записать();

КонецФункции
